setup.shopDetails = {
	normal: {
		name: "нормальная",
		desc: "Одежда для повседневного использования.",
		details: "ничего",
	},
	formal: {
		name: "Формальная",
		desc: "Подходит для важных случаев и соблюдения правил этикета в определенной компании.",
		details: "Необходимый наряд для особых мероприятий и необычных свиданий.",
	},
	school: {
		name: "Школьная",
		desc: "Утвержденная форма местной школы.",
		details: "Обязательная одежда для посещения занятий - верхняя и нижняя одежда. Ношение дополнительной школьной одежды немного снизит уровень правонарушений.",
	},
	glasses: {
		name: "Очки",
		desc: "помогают вам сосредоточиться.",
		details: "Увеличивают скорость совершенствования школьных навыков.",
	},
	cool: {
		name: "Крутая",
		desc: "Это делает вас более популярным, но некоторым учителям это может не понравиться.",
		details: "Увеличивает скорость повышения статуса школы. Может вызвать негативные последствия со стороны учителей, которые не одобряют такое.",
	},
	swim: {
		name: "Для плавания",
		desc: "Хорошо держится под водой.",
		details: "Поможет вам успешно пройти проверку навыков плавания. Предотвращает проникновение влаги сквозь одежду.",
	},
	diving: {
		name: "Для дайвинга",
		desc: "Помогает сохранять тепло под водой.",
		details: "Предотвращает повышение стресса при плавании в холодной воде.",
	},
	dance: {
		name: "Для танцев",
		desc: "Достаточно гибкая, чтобы выдерживать суровые условия танцпола.",
		details: "Не порвется во время танца, в отличии от обычной одежды.",
	},
	costume: {
		name: "Костюм",
		desc: "Люди могут смотреть на такое косо за пределами подходящих ситуаций.",
		details: "Запускает уникальный диалог или действия в определенных событиях.",
	},
	serving: {
		name: "Обслуживание",
		desc: "Поощряет чаевые при работе барменом, официантом или официанткой, если они видны.",
		details: "Увеличивает сумму денег, получаемую за каждые чаевые, на 20% за каждый предмет с этим свойством.",
	},
	fetish: {
		name: "Фетиш",
		desc: "По своей сути являются непристойными.",
		details: "Увеличивает минимальный порог возбуждения.",
	},
	sleep: {
		name: "Для сна",
		desc: "Мягкая и уютная. Может улучшить качество вашего сна.",
		details: "Снижает дополнительную усталость во время сна. Если вы будете спать в одежде, отличной от пижамы, нижнего белья и других необычных предметов, этот эффект будет сведен на нет.",
	},
	mask: {
		name: "Маска",
		desc: "Скрывает вашу личность, но не обманет полицию или людей, которые вас знают.",
		details: "Останавливает рост известности, как положительной, так и отрицательной.",
	},
	holy: {
		name: "Святая",
		desc: "Священная для местной веры.",
		details: "Увеличивает прирост или потерю чистоты.",
	},
	dark: {
		name: "Темная",
		desc: "Местная вера считает это непристойным.",
		details: "Повышает осведомленность о выгодах и потерях.",
	},
	binding: {
		name: "Связанная",
		desc: "Держит ваши руки в полной безопасности и делает их беспомощными.",
		details: "Мешает вам пользоваться руками.",
	},
	stealthy: {
		name: "Скрытная",
		desc: "Это затрудняет отслеживание ваших преступлений.",
		details: "Уменьшает количество известных полиции преступлений, совершаемых в результате воровства.",
	},
	sticky_fingers: {
		name: "Липкие пальцы",
		desc: "Больше шансов добиться своего и сохранить то, что тебе не принадлежит.",
		details: "Поможет вам добиться успеха в проверке навыков мошенничества.",
	},
	rainproof: {
		name: "Непромокаемая",
		desc: "Защитит тебя от дождя.",
		details: "Предохраняет вашу одежду от промокания под дождем и снегом.",
	},
	bimbo: {
		name: "Особая Ж",
		desc: "В этом наборе одежды есть что-то особенное.",
		details: `Феминизирует ваш тип фигуры, увеличивает размер груди и ягодиц, а также уменьшает размер пениса. Способствует развитию "похотливой" черты характера..`,
	},
	himbo: {
		name: "Особая М",
		desc: "Защищает вас от дождя.",
		details: `Маскулинизирует ваш тип телосложения, уменьшает размер груди и ягодиц и увеличивает размер пениса. Способствует развитию "похотливой" черты характера..`,
	},
	heels: {
		name: "На высоком каблуке",
		desc: "В нем трудно передвигаться, если только у вас нет умелых ног.",
		details: 
			"Улучшает силу удара ногой во время боя. Снижает скорость передвижения. Может вызвать усталость и привести к неудачнам с проверкой атлетических способностей на фермах, болотах и в лесу..",
	},
	rugged: {
		name: "Надёжная",
		desc: "Помогает вам устоять на ногах в сложных условиях.",
		details: "Поможет вам добиться успеха в проверке атлетики на фермах, вересковых пустошах и в лесу.",
	},
	chest_bind: {
		name: "Перевязка груди",
		desc: "Плотно облегает грудь, скрывая ее.",
		details: `Уменьшает видимый размер груди. Грудь, размер которой превышает "скромный", не будет выглядеть идеально плоской, а вместо этого будет казаться на пять размеров меньше.`,
	},
	eerie: {
		name: "Зловещая",
		get desc() {
			return V.transformdisable === "f"
				? "Защищает определенную трансформацию. Трансформации развиваются и прекращаются в полночь."
				: "В этом предмете есть что-то необычное.";
		},
		get details() {
			return V.transformdisable === "f" ? "Предотвращает разрушение связанной с ним трансформации." : "Включите преобразования, чтобы использовать эту черту.";
		},
	},
	shade: {
		name: "Тень",
		desc: "Заслоняет солнце.",
		details: "Защищает вашу кожу от пассивного загара.",
	},
	asylum: {
		name: "Приют",
		desc: "Одежда из местного приюта.",
		details: "ничего",
	},
	prison: {
		name: "Тюрьма",
		desc: "Одежда из местной тюрьмы.",
		details: "none",
	},
	sticky: {
		name: "Липкая",
		desc: "Прилипнет к вашей коже.",
		details: "От этого будет сложно избавиться во время боя.",
	},
	"strap-on": {
		name: "Страпон",
		desc: "Облегает вашу талию.",
		details: "Может быть использован для проникновения в других людей.",
	},
	covered: {
		name: "Покрытая",
		desc: "Защищает различные части тела.",
		details:
			"На скрытой коже не должно быть никаких надписей. Одежда для лица, обладающая этим свойством, защищает ваш рот от поцелуев, проникновения и оральных ласк. Нижнее белье с этим свойством не будет считаться непристойным, если его выставлять напоказ. Нижнее белье с этим свойством будет прикрывать верхнюю часть тела, что позволит вам носить его голым.",
	},
	naked: {
		name: "Откровенная",
		desc: "Настолько откровенная, что с таким же успехом ты можешь вообще ничего не надевать.",
		details: "Раскрывает все.",
	},
	athletic: {
		name: "Спортивная",
		desc: "Подходит для занятия спортом.",
		details: "Увеличивает скорость прокачки спортивного навыка.",
	},
	riding: {
		name: "Верховая езда",
		desc: "Подходит для любителей верховой езды.",
		details: "Умение набивать ноги в сапоги, приобретенное на уроках верховой езды.",
	},
	maid: {
		name: "Горничная",
		desc: "Это делает тебя похожей на домашнюю прислугу.",
		details: "Помогает вам добиться успеха в проверке навыков ведения домашнего хозяйства.",
	},
	chastity: {
		name: "Целомудрие",
		desc: "Защищает вашу невинность, хотите вы этого или нет.",
		details: ".",
	},
	cage: {
		name: "Клетка",
		desc: "Защищает вашу невинность, хотите вы этого или нет.",
		details: "Запирает ваши гениталии, предотвращая их использование.",
	},
	hidden: {
		name: "Скрытая",
		desc: "Сохраняет ваш пол в тайне.",
		details: "Никто не может видеть, какие у тебя гениталии.",
	},
	gag: {
		name: "Кляп",
		desc: "Защищает ваш рот, но также ограничивает его использование.",
		details: "Препятствует поцелуям, проникновению и другим оральным действиям. Не позволяет говорить.",
	},
	leash: {
		name: "Поводок",
		desc: "Удобная ручка, за которую можно дергать.",
		details: "Позволяет людям грубо обращаться с вами на определенных мероприятиях.",
	},
	pushup: {
		name: "Пушап",
		desc: "Делает вашу грудь больше.",
		details: "Благодаря этому ваша грудь кажется на два размера больше.",
	},
	bellyHide: {
		name: "Скрывающая живот",
		desc: "Скрывает беременные животы, до определенной степени.",
		details: "ничего",
	},
	bellyShow: {
		name: "Показывающая живот",
		desc: "Обнажает живот. Делает беременность более заметной.",
		details: "Ничего",
	},
	constricting: {
		name: "Облегающая",
		desc: "Нельзя носить после определенного периода беременности.",
		details: "ничего",
	},
	bookbag: {
		name: "Сумка для книг",
		desc: "Для переноски школьных учебников.",
		details: "Позволяет подготовиться к уроку. Помогает избежать негативных событий в школе, связанных с учебниками.",
	},
	waterproof: {
		name: "Водонепроницаемая",
		desc: "Непроницаемая.",
		details: "Предотвращает проникновение влаги через вашу одежду.",
	},
	esoteric: {
		name: "Эзотерическая",
		desc: "Открывает то, чего быть не может.",
		details: "Вызывает галлюцинации независимо от уровня осознания, травмы или галлюциногенов.",
	},
	unstealthy: {
		name: "Небезопасный",
		desc: "Из-за этого становится еще труднее прятаться.",
		details: "Увеличивает количество раскрытых преступлений, совершенных во время воровства.",
	},
};

setup.hairDetails = {
	loose: {
		desc: "Волосы, которые свободно падают на лицо. Отрастают и становятся длинными.",
	},
	short: {
		desc: "Волосы, которые выглядят короткими при укладке, даже если ваши волосы отросли.",
	},
	curly: {
		desc: "Вьющиеся волосы.",
	},
	sleek: {
		desc: "Прямые волосы.",
	},
	textured: {
		desc: "Волосы с африканской текстурой.",
	},
	wavy: {
		desc: "Не совсем вьющиеся, но и не совсем прямые.",
	},
	pigtails: {
		desc: "Два пучка волос, свисающих по обе стороны головы.",
	},
	buns: {
		desc: "Волосы, которые были скручены вокруг себя и закреплены на месте.",
	},
	braids: {
		desc: "Переплетенные пряди волос. Включает в себя укладки, которые технически не являются косичками, например, дреды.",
	},
	ponytail: {
		desc: "Волосы собраны на затылке.",
	},
};
